7767517
486 570
Input                    in0                      0 1 in0
Convolution              conv_10                  1 1 in0 1 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1728
Swish                    silu_126                 1 1 1 2
Convolution              conv_11                  1 1 2 3 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_127                 1 1 3 4
Convolution              conv_12                  1 1 4 5 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_128                 1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,64,64 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_13                  1 1 11 12 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_129                 1 1 12 13
Split                    splitncnn_1              1 2 13 14 15
Convolution              conv_14                  1 1 15 16 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_130                 1 1 16 17
Convolution              conv_15                  1 1 17 18 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_131                 1 1 18 19
BinaryOp                 add_0                    2 1 14 19 20 0=0
Split                    splitncnn_2              1 2 20 21 22
Convolution              conv_16                  1 1 22 23 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_132                 1 1 23 24
Convolution              conv_17                  1 1 24 25 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_133                 1 1 25 26
BinaryOp                 add_1                    2 1 21 26 27 0=0
Convolution              conv_18                  1 1 10 28 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_134                 1 1 28 29
Concat                   cat_0                    2 1 27 29 30 0=0
Convolution              conv_19                  1 1 30 31 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_135                 1 1 31 32
Concat                   cat_1                    3 1 7 9 32 33 0=0
Convolution              conv_20                  1 1 33 34 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_136                 1 1 34 35
Convolution              conv_21                  1 1 35 36 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_137                 1 1 36 37
Convolution              conv_22                  1 1 37 38 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_138                 1 1 38 39
Slice                    split_1                  1 2 39 40 41 -23300=2,128,128 1=0
Split                    splitncnn_3              1 3 41 42 43 44
Convolution              conv_23                  1 1 44 45 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_139                 1 1 45 46
Split                    splitncnn_4              1 2 46 47 48
Convolution              conv_24                  1 1 48 49 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_140                 1 1 49 50
Convolution              conv_25                  1 1 50 51 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_141                 1 1 51 52
BinaryOp                 add_2                    2 1 47 52 53 0=0
Split                    splitncnn_5              1 2 53 54 55
Convolution              conv_26                  1 1 55 56 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_142                 1 1 56 57
Convolution              conv_27                  1 1 57 58 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_143                 1 1 58 59
BinaryOp                 add_3                    2 1 54 59 60 0=0
Convolution              conv_28                  1 1 43 61 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_144                 1 1 61 62
Concat                   cat_2                    2 1 60 62 63 0=0
Convolution              conv_29                  1 1 63 64 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_145                 1 1 64 65
Concat                   cat_3                    3 1 40 42 65 66 0=0
Convolution              conv_30                  1 1 66 67 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
Swish                    silu_146                 1 1 67 68
Split                    splitncnn_6              1 2 68 69 70
Convolution              conv_31                  1 1 70 71 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2359296
Swish                    silu_147                 1 1 71 72
Convolution              conv_32                  1 1 72 73 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_148                 1 1 73 74
Split                    splitncnn_7              1 3 74 75 76 77
Convolution              conv_33                  1 1 77 78 0=768 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
Reshape                  flatten_305              1 1 78 79 0=-1 1=768
Permute                  transpose_329            1 1 79 80 0=1
Reshape                  reshape_275              1 1 80 81 0=96 1=8 11=400 2=4
Permute                  permute_235              1 1 81 82 0=3
Slice                    split_2                  1 3 82 83 84 85 -23300=3,32,32,32 1=2
Split                    splitncnn_8              1 2 85 86 87
Permute                  transpose_330            1 1 83 88 0=1
MatMul                   matmul_313               2 1 88 84 89
BinaryOp                 mul_4                    1 1 89 90 0=2 1=1 2=1.767770e-01
Softmax                  softmax_1                1 1 90 91 0=3 1=1
MatMul                   matmultransb_0           2 1 87 91 92 0=1
Permute                  permute_236              1 1 92 93 0=4
Permute                  permute_237              1 1 86 94 0=4
Reshape                  reshape_276              1 1 93 95 0=256 1=40 2=40
Permute                  permute_238              1 1 95 96 0=4
Reshape                  reshape_277              1 1 94 97 0=256 1=40 2=40
Permute                  permute_239              1 1 97 98 0=4
ConvolutionDepthWise     convdw_354               1 1 98 99 0=256 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=12544 7=256
BinaryOp                 add_5                    2 1 96 99 100 0=0
Convolution              conv_34                  1 1 100 101 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_6                    2 1 76 101 102 0=0
Split                    splitncnn_9              1 2 102 103 104
Convolution              conv_35                  1 1 104 105 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_149                 1 1 105 106
Convolution              conv_36                  1 1 106 107 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_7                    2 1 103 107 108 0=0
Split                    splitncnn_10             1 2 108 109 110
Convolution              conv_37                  1 1 110 111 0=768 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
Reshape                  flatten_306              1 1 111 112 0=-1 1=768
Permute                  transpose_332            1 1 112 113 0=1
Reshape                  reshape_278              1 1 113 114 0=96 1=8 11=400 2=4
Permute                  permute_240              1 1 114 115 0=3
Slice                    split_3                  1 3 115 116 117 118 -23300=3,32,32,32 1=2
Split                    splitncnn_11             1 2 118 119 120
Permute                  transpose_333            1 1 116 121 0=1
MatMul                   matmul_315               2 1 121 117 122
BinaryOp                 mul_8                    1 1 122 123 0=2 1=1 2=1.767770e-01
Softmax                  softmax_2                1 1 123 124 0=3 1=1
MatMul                   matmultransb_1           2 1 120 124 125 0=1
Permute                  permute_241              1 1 125 126 0=4
Permute                  permute_242              1 1 119 127 0=4
Reshape                  reshape_279              1 1 126 128 0=256 1=40 2=40
Permute                  permute_243              1 1 128 129 0=4
Reshape                  reshape_280              1 1 127 130 0=256 1=40 2=40
Permute                  permute_244              1 1 130 131 0=4
ConvolutionDepthWise     convdw_355               1 1 131 132 0=256 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=12544 7=256
BinaryOp                 add_9                    2 1 129 132 133 0=0
Convolution              conv_38                  1 1 133 134 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_10                   2 1 109 134 135 0=0
Split                    splitncnn_12             1 2 135 136 137
Convolution              conv_39                  1 1 137 138 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_150                 1 1 138 139
Convolution              conv_40                  1 1 139 140 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_11                   2 1 136 140 141 0=0
Split                    splitncnn_13             1 3 141 142 143 144
Convolution              conv_41                  1 1 144 145 0=768 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
Reshape                  flatten_307              1 1 145 146 0=-1 1=768
Permute                  transpose_335            1 1 146 147 0=1
Reshape                  reshape_281              1 1 147 148 0=96 1=8 11=400 2=4
Permute                  permute_245              1 1 148 149 0=3
Slice                    split_4                  1 3 149 150 151 152 -23300=3,32,32,32 1=2
Split                    splitncnn_14             1 2 152 153 154
Permute                  transpose_336            1 1 150 155 0=1
MatMul                   matmul_317               2 1 155 151 156
BinaryOp                 mul_12                   1 1 156 157 0=2 1=1 2=1.767770e-01
Softmax                  softmax_3                1 1 157 158 0=3 1=1
MatMul                   matmultransb_2           2 1 154 158 159 0=1
Permute                  permute_246              1 1 159 160 0=4
Permute                  permute_247              1 1 153 161 0=4
Reshape                  reshape_282              1 1 160 162 0=256 1=40 2=40
Permute                  permute_248              1 1 162 163 0=4
Reshape                  reshape_283              1 1 161 164 0=256 1=40 2=40
Permute                  permute_249              1 1 164 165 0=4
ConvolutionDepthWise     convdw_356               1 1 165 166 0=256 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=12544 7=256
BinaryOp                 add_13                   2 1 163 166 167 0=0
Convolution              conv_42                  1 1 167 168 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_14                   2 1 143 168 169 0=0
Split                    splitncnn_15             1 2 169 170 171
Convolution              conv_43                  1 1 171 172 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_151                 1 1 172 173
Convolution              conv_44                  1 1 173 174 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_15                   2 1 170 174 175 0=0
Split                    splitncnn_16             1 2 175 176 177
Convolution              conv_45                  1 1 177 178 0=768 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
Reshape                  flatten_308              1 1 178 179 0=-1 1=768
Permute                  transpose_338            1 1 179 180 0=1
Reshape                  reshape_284              1 1 180 181 0=96 1=8 11=400 2=4
Permute                  permute_250              1 1 181 182 0=3
Slice                    split_5                  1 3 182 183 184 185 -23300=3,32,32,32 1=2
Split                    splitncnn_17             1 2 185 186 187
Permute                  transpose_339            1 1 183 188 0=1
MatMul                   matmul_319               2 1 188 184 189
BinaryOp                 mul_16                   1 1 189 190 0=2 1=1 2=1.767770e-01
Softmax                  softmax_4                1 1 190 191 0=3 1=1
MatMul                   matmultransb_3           2 1 187 191 192 0=1
Permute                  permute_251              1 1 192 193 0=4
Permute                  permute_252              1 1 186 194 0=4
Reshape                  reshape_285              1 1 193 195 0=256 1=40 2=40
Permute                  permute_253              1 1 195 196 0=4
Reshape                  reshape_286              1 1 194 197 0=256 1=40 2=40
Permute                  permute_254              1 1 197 198 0=4
ConvolutionDepthWise     convdw_357               1 1 198 199 0=256 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=12544 7=256
BinaryOp                 add_17                   2 1 196 199 200 0=0
Convolution              conv_46                  1 1 200 201 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_18                   2 1 176 201 202 0=0
Split                    splitncnn_18             1 2 202 203 204
Convolution              conv_47                  1 1 204 205 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_152                 1 1 205 206
Convolution              conv_48                  1 1 206 207 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_19                   2 1 203 207 208 0=0
Concat                   cat_4                    3 1 75 142 208 209 0=0
Convolution              conv_49                  1 1 209 210 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_153                 1 1 210 211
Split                    splitncnn_19             1 2 211 212 213
Convolution              conv_50                  1 1 213 214 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2359296
Swish                    silu_154                 1 1 214 215
Convolution              conv_51                  1 1 215 216 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_155                 1 1 216 217
Split                    splitncnn_20             1 3 217 218 219 220
Convolution              conv_52                  1 1 220 221 0=768 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
Reshape                  flatten_309              1 1 221 222 0=-1 1=768
Permute                  transpose_341            1 1 222 223 0=1
Reshape                  view_296                 1 1 223 224 0=96 1=8 2=400
Permute                  permute_255              1 1 224 225 0=3
Slice                    split_6                  1 3 225 226 227 228 -23300=3,32,32,32 1=1
Split                    splitncnn_21             1 2 228 229 230
Permute                  transpose_342            1 1 226 231 0=1
MatMul                   matmul_321               2 1 231 227 232
BinaryOp                 mul_20                   1 1 232 233 0=2 1=1 2=1.767770e-01
Softmax                  softmax_5                1 1 233 234 0=2 1=1
MatMul                   matmultransb_4           2 1 230 234 235 0=1
Permute                  permute_256              1 1 235 236 0=4
Permute                  permute_257              1 1 229 237 0=4
Reshape                  reshape_287              1 1 236 238 0=256 1=20 2=20
Permute                  permute_258              1 1 238 239 0=4
Reshape                  reshape_288              1 1 237 240 0=256 1=20 2=20
Permute                  permute_259              1 1 240 241 0=4
ConvolutionDepthWise     convdw_358               1 1 241 242 0=256 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=12544 7=256
BinaryOp                 add_21                   2 1 239 242 243 0=0
Convolution              conv_53                  1 1 243 244 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_22                   2 1 219 244 245 0=0
Split                    splitncnn_22             1 2 245 246 247
Convolution              conv_54                  1 1 247 248 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_156                 1 1 248 249
Convolution              conv_55                  1 1 249 250 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_23                   2 1 246 250 251 0=0
Split                    splitncnn_23             1 2 251 252 253
Convolution              conv_56                  1 1 253 254 0=768 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
Reshape                  flatten_310              1 1 254 255 0=-1 1=768
Permute                  transpose_344            1 1 255 256 0=1
Reshape                  view_297                 1 1 256 257 0=96 1=8 2=400
Permute                  permute_260              1 1 257 258 0=3
Slice                    split_7                  1 3 258 259 260 261 -23300=3,32,32,32 1=1
Split                    splitncnn_24             1 2 261 262 263
Permute                  transpose_345            1 1 259 264 0=1
MatMul                   matmul_323               2 1 264 260 265
BinaryOp                 mul_24                   1 1 265 266 0=2 1=1 2=1.767770e-01
Softmax                  softmax_6                1 1 266 267 0=2 1=1
MatMul                   matmultransb_5           2 1 263 267 268 0=1
Permute                  permute_261              1 1 268 269 0=4
Permute                  permute_262              1 1 262 270 0=4
Reshape                  reshape_289              1 1 269 271 0=256 1=20 2=20
Permute                  permute_263              1 1 271 272 0=4
Reshape                  reshape_290              1 1 270 273 0=256 1=20 2=20
Permute                  permute_264              1 1 273 274 0=4
ConvolutionDepthWise     convdw_359               1 1 274 275 0=256 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=12544 7=256
BinaryOp                 add_25                   2 1 272 275 276 0=0
Convolution              conv_57                  1 1 276 277 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_26                   2 1 252 277 278 0=0
Split                    splitncnn_25             1 2 278 279 280
Convolution              conv_58                  1 1 280 281 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_157                 1 1 281 282
Convolution              conv_59                  1 1 282 283 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_27                   2 1 279 283 284 0=0
Split                    splitncnn_26             1 3 284 285 286 287
Convolution              conv_60                  1 1 287 288 0=768 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
Reshape                  flatten_311              1 1 288 289 0=-1 1=768
Permute                  transpose_347            1 1 289 290 0=1
Reshape                  view_298                 1 1 290 291 0=96 1=8 2=400
Permute                  permute_265              1 1 291 292 0=3
Slice                    split_8                  1 3 292 293 294 295 -23300=3,32,32,32 1=1
Split                    splitncnn_27             1 2 295 296 297
Permute                  transpose_348            1 1 293 298 0=1
MatMul                   matmul_325               2 1 298 294 299
BinaryOp                 mul_28                   1 1 299 300 0=2 1=1 2=1.767770e-01
Softmax                  softmax_7                1 1 300 301 0=2 1=1
MatMul                   matmultransb_6           2 1 297 301 302 0=1
Permute                  permute_266              1 1 302 303 0=4
Permute                  permute_267              1 1 296 304 0=4
Reshape                  reshape_291              1 1 303 305 0=256 1=20 2=20
Permute                  permute_268              1 1 305 306 0=4
Reshape                  reshape_292              1 1 304 307 0=256 1=20 2=20
Permute                  permute_269              1 1 307 308 0=4
ConvolutionDepthWise     convdw_360               1 1 308 309 0=256 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=12544 7=256
BinaryOp                 add_29                   2 1 306 309 310 0=0
Convolution              conv_61                  1 1 310 311 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_30                   2 1 286 311 312 0=0
Split                    splitncnn_28             1 2 312 313 314
Convolution              conv_62                  1 1 314 315 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_158                 1 1 315 316
Convolution              conv_63                  1 1 316 317 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_31                   2 1 313 317 318 0=0
Split                    splitncnn_29             1 2 318 319 320
Convolution              conv_64                  1 1 320 321 0=768 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
Reshape                  flatten_312              1 1 321 322 0=-1 1=768
Permute                  transpose_350            1 1 322 323 0=1
Reshape                  view_299                 1 1 323 324 0=96 1=8 2=400
Permute                  permute_270              1 1 324 325 0=3
Slice                    split_9                  1 3 325 326 327 328 -23300=3,32,32,32 1=1
Split                    splitncnn_30             1 2 328 329 330
Permute                  transpose_351            1 1 326 331 0=1
MatMul                   matmul_327               2 1 331 327 332
BinaryOp                 mul_32                   1 1 332 333 0=2 1=1 2=1.767770e-01
Softmax                  softmax_8                1 1 333 334 0=2 1=1
MatMul                   matmultransb_7           2 1 330 334 335 0=1
Permute                  permute_271              1 1 335 336 0=4
Permute                  permute_272              1 1 329 337 0=4
Reshape                  reshape_293              1 1 336 338 0=256 1=20 2=20
Permute                  permute_273              1 1 338 339 0=4
Reshape                  reshape_294              1 1 337 340 0=256 1=20 2=20
Permute                  permute_274              1 1 340 341 0=4
ConvolutionDepthWise     convdw_361               1 1 341 342 0=256 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=12544 7=256
BinaryOp                 add_33                   2 1 339 342 343 0=0
Convolution              conv_65                  1 1 343 344 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_34                   2 1 319 344 345 0=0
Split                    splitncnn_31             1 2 345 346 347
Convolution              conv_66                  1 1 347 348 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_159                 1 1 348 349
Convolution              conv_67                  1 1 349 350 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_35                   2 1 346 350 351 0=0
Concat                   cat_5                    3 1 218 285 351 352 0=0
Convolution              conv_68                  1 1 352 353 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_160                 1 1 353 354
Split                    splitncnn_32             1 2 354 355 356
Interp                   upsample_217             1 1 356 357 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_6                    2 1 357 212 358 0=0
Convolution              conv_69                  1 1 358 359 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_161                 1 1 359 360
Split                    splitncnn_33             1 3 360 361 362 363
Convolution              conv_70                  1 1 363 364 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_162                 1 1 364 365
Split                    splitncnn_34             1 2 365 366 367
Convolution              conv_71                  1 1 367 368 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_163                 1 1 368 369
Convolution              conv_72                  1 1 369 370 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_164                 1 1 370 371
BinaryOp                 add_36                   2 1 366 371 372 0=0
Split                    splitncnn_35             1 2 372 373 374
Convolution              conv_73                  1 1 374 375 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_165                 1 1 375 376
Convolution              conv_74                  1 1 376 377 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_166                 1 1 377 378
BinaryOp                 add_37                   2 1 373 378 379 0=0
Convolution              conv_75                  1 1 362 380 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_167                 1 1 380 381
Concat                   cat_7                    2 1 379 381 382 0=0
Convolution              conv_76                  1 1 382 383 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_168                 1 1 383 384
Concat                   cat_8                    2 1 361 384 385 0=0
Convolution              conv_77                  1 1 385 386 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_169                 1 1 386 387
Split                    splitncnn_36             1 2 387 388 389
Interp                   upsample_218             1 1 389 390 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_9                    2 1 390 69 391 0=0
Convolution              conv_78                  1 1 391 392 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_170                 1 1 392 393
Split                    splitncnn_37             1 3 393 394 395 396
Convolution              conv_79                  1 1 396 397 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_171                 1 1 397 398
Split                    splitncnn_38             1 2 398 399 400
Convolution              conv_80                  1 1 400 401 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_172                 1 1 401 402
Convolution              conv_81                  1 1 402 403 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_173                 1 1 403 404
BinaryOp                 add_38                   2 1 399 404 405 0=0
Split                    splitncnn_39             1 2 405 406 407
Convolution              conv_82                  1 1 407 408 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_174                 1 1 408 409
Convolution              conv_83                  1 1 409 410 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_175                 1 1 410 411
BinaryOp                 add_39                   2 1 406 411 412 0=0
Convolution              conv_84                  1 1 395 413 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_176                 1 1 413 414
Concat                   cat_10                   2 1 412 414 415 0=0
Convolution              conv_85                  1 1 415 416 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_177                 1 1 416 417
Concat                   cat_11                   2 1 394 417 418 0=0
Convolution              conv_86                  1 1 418 419 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_178                 1 1 419 420
Split                    splitncnn_40             1 3 420 421 422 423
Convolution              conv_87                  1 1 422 424 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_179                 1 1 424 425
Concat                   cat_12                   2 1 425 388 426 0=0
Convolution              conv_88                  1 1 426 427 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
Swish                    silu_180                 1 1 427 428
Split                    splitncnn_41             1 3 428 429 430 431
Convolution              conv_89                  1 1 431 432 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_181                 1 1 432 433
Split                    splitncnn_42             1 2 433 434 435
Convolution              conv_90                  1 1 435 436 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_182                 1 1 436 437
Convolution              conv_91                  1 1 437 438 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_183                 1 1 438 439
BinaryOp                 add_40                   2 1 434 439 440 0=0
Split                    splitncnn_43             1 2 440 441 442
Convolution              conv_92                  1 1 442 443 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_184                 1 1 443 444
Convolution              conv_93                  1 1 444 445 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_185                 1 1 445 446
BinaryOp                 add_41                   2 1 441 446 447 0=0
Convolution              conv_94                  1 1 430 448 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_186                 1 1 448 449
Concat                   cat_13                   2 1 447 449 450 0=0
Convolution              conv_95                  1 1 450 451 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_187                 1 1 451 452
Concat                   cat_14                   2 1 429 452 453 0=0
Convolution              conv_96                  1 1 453 454 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_188                 1 1 454 455
Split                    splitncnn_44             1 3 455 456 457 458
Convolution              conv_97                  1 1 457 459 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2359296
Swish                    silu_189                 1 1 459 460
Concat                   cat_15                   2 1 460 355 461 0=0
Convolution              conv_98                  1 1 461 462 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_190                 1 1 462 463
Slice                    split_10                 1 2 463 464 465 -23300=2,256,256 1=0
Split                    splitncnn_45             1 3 465 466 467 468
Convolution              conv_99                  1 1 468 469 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_191                 1 1 469 470
Split                    splitncnn_46             1 2 470 471 472
Convolution              conv_100                 1 1 472 473 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_192                 1 1 473 474
Convolution              conv_101                 1 1 474 475 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_193                 1 1 475 476
BinaryOp                 add_42                   2 1 471 476 477 0=0
Split                    splitncnn_47             1 2 477 478 479
Convolution              conv_102                 1 1 479 480 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_194                 1 1 480 481
Convolution              conv_103                 1 1 481 482 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_195                 1 1 482 483
BinaryOp                 add_43                   2 1 478 483 484 0=0
Convolution              conv_104                 1 1 467 485 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_196                 1 1 485 486
Concat                   cat_16                   2 1 484 486 487 0=0
Convolution              conv_105                 1 1 487 488 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_197                 1 1 488 489
Concat                   cat_17                   3 1 464 466 489 490 0=0
Convolution              conv_106                 1 1 490 491 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_198                 1 1 491 492
Split                    splitncnn_48             1 2 492 493 494
MemoryData               pnnx_1056                0 1 495 0=8400
Convolution              conv_107                 1 1 421 496 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_199                 1 1 496 497
Convolution              conv_108                 1 1 497 498 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_200                 1 1 498 499
Convolution              conv_109                 1 1 499 500 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_362               1 1 423 501 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_201                 1 1 501 502
Convolution              conv_110                 1 1 502 503 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_202                 1 1 503 504
ConvolutionDepthWise     convdw_363               1 1 504 505 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_203                 1 1 505 506
Convolution              conv_111                 1 1 506 507 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_204                 1 1 507 508
Convolution              conv_112                 1 1 508 509 0=5 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1280
Concat                   cat_18                   2 1 500 509 510 0=0
Convolution              conv_113                 1 1 456 511 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Swish                    silu_205                 1 1 511 512
Convolution              conv_114                 1 1 512 513 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_206                 1 1 513 514
Convolution              conv_115                 1 1 514 515 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_364               1 1 458 516 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Swish                    silu_207                 1 1 516 517
Convolution              conv_116                 1 1 517 518 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_208                 1 1 518 519
ConvolutionDepthWise     convdw_365               1 1 519 520 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_209                 1 1 520 521
Convolution              conv_117                 1 1 521 522 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_210                 1 1 522 523
Convolution              conv_118                 1 1 523 524 0=5 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1280
Concat                   cat_19                   2 1 515 524 525 0=0
Convolution              conv_119                 1 1 493 526 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Swish                    silu_211                 1 1 526 527
Convolution              conv_120                 1 1 527 528 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_212                 1 1 528 529
Convolution              conv_121                 1 1 529 530 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_366               1 1 494 531 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Swish                    silu_213                 1 1 531 532
Convolution              conv_122                 1 1 532 533 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_214                 1 1 533 534
ConvolutionDepthWise     convdw_367               1 1 534 535 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_215                 1 1 535 536
Convolution              conv_123                 1 1 536 537 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_216                 1 1 537 538
Convolution              conv_124                 1 1 538 539 0=5 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1280
Concat                   cat_20                   2 1 530 539 540 0=0
Reshape                  view_300                 1 1 510 541 0=6400 1=69
Reshape                  view_301                 1 1 525 542 0=1600 1=69
Reshape                  view_302                 1 1 540 543 0=400 1=69
Concat                   cat_21                   3 1 541 542 543 544 0=1
Slice                    split_11                 1 2 544 545 546 -23300=2,64,5 1=0
Reshape                  view_303                 1 1 545 547 0=8400 1=16 2=4
Permute                  transpose_353            1 1 547 548 0=2
Softmax                  softmax_9                1 1 548 549 0=0 1=1
Convolution              conv_125                 1 1 549 550 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  view_304                 1 1 550 551 0=8400 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 552 0=8400 1=2
MemoryData               pnnx_fold_anchor_points.1_1 0 1 553 0=8400 1=2
Slice                    chunk_0                  1 2 551 554 555 -23300=2,-233,-233 1=0
BinaryOp                 sub_44                   2 1 552 554 556 0=1
Split                    splitncnn_49             1 2 556 557 558
BinaryOp                 add_45                   2 1 553 555 559 0=0
Split                    splitncnn_50             1 2 559 560 561
BinaryOp                 add_46                   2 1 557 560 562 0=0
BinaryOp                 div_47                   1 1 562 563 0=3 1=1 2=2.000000e+00
BinaryOp                 sub_48                   2 1 561 558 564 0=1
Concat                   cat_22                   2 1 563 564 565 0=0
Reshape                  reshape_295              1 1 495 566 0=8400 1=1
BinaryOp                 mul_49                   2 1 565 566 567 0=2
Sigmoid                  sigmoid_0                1 1 546 568
Concat                   cat_23                   2 1 567 568 out0 0=0
